let _book_page_name = [];
let _book_page_ = [];

function book()
{
    content.innerHTML = _book;
    book_menu_content();

    _book_cash_page_number = localStorage.getItem("book_cash_page_number") != null ? localStorage.getItem("book_cash_page_number") : 0;
    book_menu(_book_cash_page_number);
}

function book_menu_content()
{
    for (let i = 0; i < _book_page_name.length; i++)
    {
        book_content_links.innerHTML += '<div class = "menu_link_page" id = "page_list_' + i + '"' + ' onclick = "book_menu(' + i + ')">' + _book_page_name[i] + '</div>'
    }
}

function book_menu(_page)
{
    book_pages.innerHTML = _book_page_[_page];
    localStorage.setItem("book_cash_page_number", _page);
    book_page_marker(_page);
    
    book_pages.scrollTo({top: 0,behavior: 'smooth'});

    imager.style.cssText = book_side_image_inside.style.cssText = book_side_image.style.cssText = "background-image : url(images/image_" + _page + ".png)";

    
}

function book_page_marker(_page)
{
    let _page_list = document.querySelectorAll('#book_content_links div');

    for (let i = 0; i < _page_list.length; i++)
    {
        document.getElementById(_page_list[i].id).className = "menu_link_page";
    }
    document.getElementById(_page_list[_page].id).className = "menu_link_page_active";
}





function book_scroll_load()
{
    _book_cash_page_scrolltop = localStorage.getItem("book_cash_page_scrolltop") != null ? localStorage.getItem("book_cash_page_scrolltop") : 0;
    book_pages.scrollTo({top: _book_cash_page_scrolltop, behavior: 'smooth'});

    _book_cash_contents_scrollmenu = localStorage.getItem("book_cash_contents_scrollmenu") != null ? localStorage.getItem("book_cash_contents_scrollmenu") : 0;
    book_contents.scrollTo({top: _book_cash_contents_scrollmenu, behavior: 'smooth'});
}







//////////////////////////////////---~ TESTER ~---////////////////////////////////////
let _scroll_top = 0;


tester.innerHTML = '<div id = "tester_scroll_top">_scroll_top ~ ...</div>' +
                   '<div id = "tester_scroll_menu">_scroll_menu ~ ...</div>' +
                   '<div id = "tester_position_key_item">_position_key_item ~ ...</div>' +
                   '<div id = "tester_position_cursor">_position_cursor ~ ...</div>' +
                   '<div id = "tester_screen_height">_screen_height ~ ...</div>';

setInterval(() => 
    {
        if(menu_link_1.className == "menu_link_active")
        {
            if(_scroll_top != book_pages.scrollTop )
            {
                localStorage.setItem("book_cash_page_scrolltop", book_pages.scrollTop);
                _scroll_top = book_pages.scrollTop;
                tester_scroll_top.innerHTML = "_scroll_top ~ " + _scroll_top;//////////////////////////////////////
            }
        }
    }, 1000);

let _scroll_menu = 0;
setInterval(() => 
    {
        if(menu_link_1.className == "menu_link_active")
        {
            if(_scroll_menu != book_contents.scrollTop)
            {
                localStorage.setItem("book_cash_contents_scrollmenu", book_contents.scrollTop);
                _scroll_menu = book_contents.scrollTop;
                tester_scroll_menu.innerHTML = "_scroll_menu ~ " + _scroll_menu;//////////////////////////////////////
            }
        }
    }, 1000);

let _position_key_item = 0;
setInterval(() => 
    {
        if(menu_link_1.className == "menu_link_active")
        {
            /* if(_scroll_menu != book_contents.scrollTop)
            {
                localStorage.setItem("book_cash_contents_scrollmenu", book_contents.scrollTop);
                _scroll_menu = book_contents.scrollTop;
                tester_scroll_menu.innerHTML = "_scroll_menu ~ " + _scroll_menu;//////////////////////////////////////
            } */
            tester_position_key_item.innerHTML = '_position_key_item ~ ' + Math.round(tester_key_item.getBoundingClientRect().top);
        }
    }, 1000);

let _position_cursor = 0;
setInterval(() => 
{
    if(menu_link_1.className == "menu_link_active")
    {
        /* if(_scroll_menu != book_contents.scrollTop)
        {
            localStorage.setItem("book_cash_contents_scrollmenu", book_contents.scrollTop);
            _scroll_menu = book_contents.scrollTop;
            tester_scroll_menu.innerHTML = "_scroll_menu ~ " + _scroll_menu;//////////////////////////////////////
        } */

            document.addEventListener('mousemove', function (event) {
            window.lastMouseX = event.clientX;
            window.lastMouseY = event.clientY;
            }, {once: true});

        tester_position_cursor.innerHTML = '_position_cursor ~ ' + window.lastMouseX + " : " + 
        window.lastMouseY;
    }
}, 200);

let _screen_height = 0;
//offsetHeight;
setInterval(() => 
{
    if(menu_link_1.className == "menu_link_active")
    {
        tester_screen_height.innerHTML = book_pages.offsetHeight;
        tester_box.style.cssText = "width: " + book_pages.offsetWidth + "px; height: " + book_pages.offsetHeight + "px; left: " + Math.round(book_pages.getBoundingClientRect().left) + "px; top: " + Math.round(book_pages.getBoundingClientRect().top) + "px;";
    }
}, 200);
//////////////////////////////////---~ TESTER ~---////////////////////////////////////






let _book = '<div class = "book_reader">' +
                '<div id = "book_side_image" onclick = "view_on()">' +
                    '<div id = "book_side_image_inside"></div>' +
                '</div>' +
                '<div id = "book_pages"></div>' +
                '<div id = "book_side_titles">' +
                    '<div id = "book_contents">' +
                        '<div class = "contents_text">Contents:</div>' +
                        '<div id = "book_content_links"></div>' +
                    '</div>' +
                '</div>' +
            '</div>';





//-----------------------------------------------------page_001-----------------------------------------------------
_book_page_name [0] = "глава 1"
_book_page_[0] = 
    '<h1>Название книги 1</h1>' + 
    '<h2>Название главы 1</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст.</p>' +
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' +
    '<h2>Название главы</h2>' + 
    '<div id = "tester_key_item">tester_key_item</div>' +
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>';

//-----------------------------------------------------page_002-----------------------------------------------------   
_book_page_name [1] = "глава 2"
_book_page_[1] = 
    '<h1>Название книги 2</h1>' + 
    '<h2>Название главы 2</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст.</p>' +
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' +
    '<h2>Название главы</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>';

    //-----------------------------------------------------page_003-----------------------------------------------------
_book_page_name [2] = "глава 3"
_book_page_[2] = 
    '<h1>Название книги 3</h1>' + 
    '<h2>Название главы 3</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст.</p>' +
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' +
    '<h2>Название главы</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>';

_book_page_name [3] = "глава 231"
_book_page_[3] = 
    '<h1>Название книги 231</h1>' + 
    '<h2>Название главы 231</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст.</p>' +
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' +
    '<h2>Название главы</h2>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>' + 
    '<p>Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. Текст-текст разный текст, еще текст, слова, всякое разное и текст. </p>';

_book_page_name [4] = "глава 4"
_book_page_name [5] = "глава 5"
_book_page_name [6] = "глава 6"
_book_page_name [7] = "глава 7"
_book_page_name [8] = "глава 8"
_book_page_name [9] = "глава 9"
_book_page_name [10] = "глава 10"
_book_page_name [11] = "глава 11"
_book_page_name [12] = "глава 12"
_book_page_name [13] = "глава 13"
_book_page_name [14] = "глава 14"
_book_page_name [15] = "глава 15"
_book_page_name [16] = "глава 16"